read_verilog -formal spi_tb.v
read_verilog -formal spi_core.v
prep -top spi_tb -nordff
clk2fflogic; opt_clean
write_smt2 -wires spi_tb.smt2
